# IMPORT / INSTALL ALL REQUIREMENTS

In [3]:
try:
    import pandas as pd
    import sklearn as sk
    import matplotlib as mtp
except ImportError:
    %pip install pandas sklearn matplotlib

# READ THE DATASET

In [14]:
data=pd.read_csv(r"../Datasets/loan.csv",index_col="ID")
#https://www.kaggle.com/teertha/personal-loan-modeling

In [17]:
data.head()

,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Personal Loan,Securities Account,CD Account,Online,CreditCard
ID,,,,,,,,,,,,,
1,25,1,49,91107,4,1.6,1,0,0,1,0,0,0
2,45,19,34,90089,3,1.5,1,0,0,1,0,0,0
3,39,15,11,94720,1,1.0,1,0,0,0,0,0,0
4,35,9,100,94112,1,2.7,2,0,0,0,0,0,0
5,35,8,45,91330,4,1.0,2,0,0,0,0,0,1